src/InformationRegisters/СостояниеЗаявокПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СостояниеЗаявокПокупателя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияСтрокДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВЗаявке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВРезерве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗаказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоступило</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтгружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>IDSite</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСообщенияОтправленного</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоСайтом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработкиСайтом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтрокаЗаявки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодсистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостояниеЗаявокПокупателя/Ext/ManagerModule.bsl
//Обмен 1С-Сайт: ОбменПартКом83_Сайт_состояние_заявок//
Процедура ДобавитьДанныеСостояниеСтрокЗаявок(Список, НомерСообщения) Экспорт
	
	Если НЕ РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт","Выгружать состояния строк заявок", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОтбораSSID = "";
	ТекущаяДата = ТекущаяДата();
	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema", "СостояниеСтрокиЗаявки");
	Выборка = ВыборкаСостоянийСтрокЗаявок();
	Пока Выборка.Следующий() Цикл
		
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		ЗаполнитьЗначенияСвойств(ОбъектXDTO, Выборка, "IDSite,Дата,Артикул,КоличествоВЗаявке,КоличествоЗаказано,КоличествоОтказано,КоличествоНаСкладе,КоличествоВыдано");
		ОбъектXDTO.Состояние = Выборка.Состояние.УникальныйИдентификатор();
		ОбъектXDTO.Склад = Выборка.Склад.УникальныйИдентификатор();
		Список.Добавить(ОбъектXDTO);
		
		СтрокаОтбораSSID = СтрокаОтбораSSID + ?(СтрокаОтбораSSID = "",  "'" + Выборка.IDSite + "'" , ", '" + Выборка.IDSite + "'");
		
		//Отмечаем непосредственно через запрос SQL//
		//Запись = РегистрыСведений.СостояниеЗаявокПокупателя.СоздатьМенеджерЗаписи();
		//Запись.СтрокаЗаявки = Выборка.СтрокаЗаявки;
		//Запись.Прочитать();
		//Запись.НомерСообщенияОтправленного = НомерСообщения;
		//Запись.ДатаОтправки = ТекущаяДата;
		//Запись.Записать();
		
	КонецЦикла;
	
	ОтметитьОтправленныеСтрокиВSQL(НомерСообщения, СтрокаОтбораSSID);
	
КонецПроцедуры
Процедура ФиксацияПринятогоСообщения(НомерСообщения) Экспорт
	
	ТекущаяДата = ТекущаяДата();
	Выборка = ВыборкаПодтвержденныхСтрокЗаявок(НомерСообщения);
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.СостояниеЗаявокПокупателя.СоздатьМенеджерЗаписи();
		Запись.СтрокаЗаявки = Выборка.СтрокаЗаявки;
		Запись.Прочитать();
		Запись.ДатаОбработкиСайтом = ТекущаяДата;
		Запись.ПолученоСайтом = Истина;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ВыборкаСостоянийСтрокЗаявок()
	
	КоличествоОбъектов = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Количество объектов в обмене", 1000);
	ОбратныйПорядокВыборки = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Обратный порядок выборки", Истина);
	УсловиеОтбора = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Условие запроса состояний строк заявок", "");
	
	Запрос = Новый Запрос(ТекстЗапросаВыборкиСостояний());
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1234", Формат(КоличествоОбъектов, "ЧГ="));
	Если НЕ ОбратныйПорядокВыборки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " УБЫВ", "");
	КонецЕсли;
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,	"НЕ СостояниеЗаявокПокупателя.СтрокаЗаявки.Виртуальная И НЕ СостояниеЗаявокПокупателя.ПолученоСайтом",
													"НЕ СостояниеЗаявокПокупателя.СтрокаЗаявки.Виртуальная И НЕ СостояниеЗаявокПокупателя.ПолученоСайтом И " + УсловиеОтбора);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();

КонецФункции
Функция ВыборкаПодтвержденныхСтрокЗаявок(НомерПринятого)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СостояниеЗаявокПокупателя.СтрокаЗаявки
	                      |ИЗ
	                      |	РегистрСведений.СостояниеЗаявокПокупателя КАК СостояниеЗаявокПокупателя
	                      |ГДЕ
	                      |	СостояниеЗаявокПокупателя.НомерСообщенияОтправленного МЕЖДУ 1 И &НомерПринятого
	                      |	И НЕ СостояниеЗаявокПокупателя.ПолученоСайтом");
	Запрос.УстановитьПараметр("НомерПринятого", НомерПринятого);
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
Функция ТекстЗапросаВыборкиСостояний()
	
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1234
	|	СостояниеЗаявокПокупателя.ДатаИзменения КАК Дата,
	|	СостояниеЗаявокПокупателя.СтрокаЗаявки.Заявка.Склад КАК Склад,
	|	СостояниеЗаявокПокупателя.IDSite,
	|	СостояниеЗаявокПокупателя.СтрокаЗаявки,
	|	СостояниеЗаявокПокупателя.Состояние,
	|	СостояниеЗаявокПокупателя.КоличествоВЗаявке,
	|	СостояниеЗаявокПокупателя.КоличествоЗаказано,
	|	СостояниеЗаявокПокупателя.КоличествоОтказ КАК КоличествоОтказано,
	|	СостояниеЗаявокПокупателя.КоличествоПоступило КАК КоличествоНаСкладе,
	|	СостояниеЗаявокПокупателя.КоличествоОтгружено КАК КоличествоВыдано,
	|	ВЫБОР
	|		КОГДА СостояниеЗаявокПокупателя.СтрокаЗаявки.ПоследняяКорректировка <> ЗНАЧЕНИЕ(Документ.КорректировкаЗаявкиПокупателя.ПустаяСсылка)
	|			ТОГДА СостояниеЗаявокПокупателя.СтрокаЗаявки.ПоследняяКорректировка
	|		ИНАЧЕ СостояниеЗаявокПокупателя.СтрокаЗаявки.Заявка
	|	КОНЕЦ КАК ДокументСвязи
	|ПОМЕСТИТЬ ДанныеСтрокиЗаявки
	|ИЗ
	|	РегистрСведений.СостояниеЗаявокПокупателя КАК СостояниеЗаявокПокупателя
	|ГДЕ
	|	НЕ СостояниеЗаявокПокупателя.СтрокаЗаявки.Виртуальная И НЕ СостояниеЗаявокПокупателя.ПолученоСайтом
	|
	|УПОРЯДОЧИТЬ ПО
	|	СостояниеЗаявокПокупателя.ДатаИзменения УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаПокупателяТовары.Ссылка КАК Документ,
	|	ЗаявкаПокупателяТовары.СтрокаЗаявки,
	|	ЗаявкаПокупателяТовары.Номенклатура
	|ПОМЕСТИТЬ ОпределениеНоменклатуры
	|ИЗ
	|	Документ.ЗаявкаПокупателя.Товары КАК ЗаявкаПокупателяТовары
	|ГДЕ
	|	ЗаявкаПокупателяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеСтрокиЗаявки.ДокументСвязи
	|			ИЗ
	|				ДанныеСтрокиЗаявки КАК ДанныеСтрокиЗаявки)
	|	И ЗаявкаПокупателяТовары.СтрокаЗаявки В
	|			(ВЫБРАТЬ
	|				ДанныеСтрокиЗаявки.СтрокаЗаявки
	|			ИЗ
	|				ДанныеСтрокиЗаявки КАК ДанныеСтрокиЗаявки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаЗаявкиПокупателяТовары.Ссылка,
	|	КорректировкаЗаявкиПокупателяТовары.СтрокаЗаявки,
	|	КорректировкаЗаявкиПокупателяТовары.Номенклатура
	|ИЗ
	|	Документ.КорректировкаЗаявкиПокупателя.Товары КАК КорректировкаЗаявкиПокупателяТовары
	|ГДЕ
	|	КорректировкаЗаявкиПокупателяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеСтрокиЗаявки.ДокументСвязи
	|			ИЗ
	|				ДанныеСтрокиЗаявки КАК ДанныеСтрокиЗаявки)
	|	И КорректировкаЗаявкиПокупателяТовары.СтрокаЗаявки В
	|			(ВЫБРАТЬ
	|				ДанныеСтрокиЗаявки.СтрокаЗаявки
	|			ИЗ
	|				ДанныеСтрокиЗаявки КАК ДанныеСтрокиЗаявки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСтрокиЗаявки.Дата,
	|	ЕСТЬNULL(ОпределениеНоменклатуры.Номенклатура.Артикул, """") КАК Артикул,
	|	ДанныеСтрокиЗаявки.Склад,
	|	ДанныеСтрокиЗаявки.IDSite,
	|	ДанныеСтрокиЗаявки.СтрокаЗаявки,
	|	ДанныеСтрокиЗаявки.Состояние,
	|	ДанныеСтрокиЗаявки.КоличествоВЗаявке,
	|	ДанныеСтрокиЗаявки.КоличествоЗаказано,
	|	ДанныеСтрокиЗаявки.КоличествоОтказано,
	|	ДанныеСтрокиЗаявки.КоличествоНаСкладе,
	|	ДанныеСтрокиЗаявки.КоличествоВыдано,
	|	ДанныеСтрокиЗаявки.ДокументСвязи
	|ИЗ
	|	ДанныеСтрокиЗаявки КАК ДанныеСтрокиЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОпределениеНоменклатуры КАК ОпределениеНоменклатуры
	|		ПО ДанныеСтрокиЗаявки.СтрокаЗаявки = ОпределениеНоменклатуры.СтрокаЗаявки
	|			И ДанныеСтрокиЗаявки.ДокументСвязи = ОпределениеНоменклатуры.Документ";
	
КонецФункции
Процедура ОтметитьОтправленныеСтрокиВSQL(НомерСообщения, СтрокаОтбораSSID)
	
	ТекущаяДата = ТекущаяДата();
	Дата = Формат(Год(ТекущаяДата), "ЧЦ=4; ЧВН=; ЧГ=") + "-" + Формат(Месяц(ТекущаяДата), "ЧЦ=2; ЧВН=; ЧГ=") + "-" + Формат(День(ТекущаяДата), "ЧЦ=2; ЧВН=; ЧГ=")+ " " + Формат(ТекущаяДата, "ДЛФ=T");
	ТекстЗапроса =	"UPDATE _InfoRg6507 set _Fld6527 = " + Формат(НомерСообщения, "ЧГ=") + ", _Fld6528 = '" + Дата + "' " +
					"WHERE _Fld6526 in (" + СтрокаОтбораSSID + ")";
	
	Попытка
		СоединениеSQL  = Новый COMОбъект("ADODB.Connection");
		КомандаSQL     = Новый COMОбъект("ADODB.Command");
		ВыборкаSQL     = Новый COMОбъект("ADODB.RecordSet");
		
		Пользователь = "partkom83";
		Пароль = "partkom83";
		База = "partkom83";
		Сервер = "nng9-v-sq-07";
		
		СоединениеSQL_ConnectionString =
		"driver={SQL Server};" +
		"server="+Сервер+";"+
		"uid="+Пользователь+";"+
		"pwd="+Пароль+";"+
		"database="+База+";";
		СоединениеSQL.ConnectionString = СоединениеSQL_ConnectionString;
		
		СоединениеSQL.ConnectionTimeout = 30;
		СоединениеSQL.CommandTimeout = 6000;
		
		СоединениеSQL.Open();
		КомандаSQL.ActiveConnection   = СоединениеSQL;
		КомандаSQL.CommandText = ТекстЗапроса;
		КомандаSQL.Execute();
		
		СоединениеSQL.Close();
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры
